
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПостановщикЗадачи = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Состояние = Справочники.СостоянияЗадач.Создана;
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПроект) Тогда
			Объект.ПроектГруппа = ПараметрыСеанса.ТекущийПроект;	
		КонецЕсли; 
	КонецЕсли; 
	//Если ЗначениеЗаполнено(Объект.Состояние) Тогда
	//	ЭтаФорма.ТолькоПросмотр = Истина;
	//КонецЕсли;
	Для каждого СтрПодзадач Из Объект.Подзадачи Цикл
		ЧекЛист.Добавить(СтрПодзадач.ПодЗадача, , СтрПодзадач.Выполнена);	
	КонецЦикла; 
	ОбновитьКомментыНаСервере();
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

Процедура ОбновитьВидимостьЭлементов()
	
	Если Объект.Состояние = Справочники.СостоянияЗадач.Создана и ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Запланировать.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаПланировании Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.ВРаботу.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Выполняется Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.НаПроверку.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаКонтроле Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Завершена Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
	Иначе //еще не записана
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Создать.ЦветФона = ЦветаСтиля.Зеленый;
	КонецЕсли; 
	
КонецПроцедуры
 

&НаСервере
Процедура РедактироватьНаСервере()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	РедактироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	врОписаниеИзХранилища = ТекущийОбъект.ОписаниеЗадачи.Получить();
	Если ТипЗнч(врОписаниеИзХранилища) = Тип("Строка") Тогда
		ВрОписание.Добавить(врОписаниеИзХранилища);
	Иначе
		ВрОписание = врОписаниеИзХранилища;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеЗадачи = Новый ХранилищеЗначения(ВрОписание);
	ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныйПериодПриИзменении(Элемент)
	
	//для ежемесячных задач
	//Объект.ОтчетныйПериод = КонецМесяца(Объект.ОтчетныйПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПометкаПриИзменении(Элемент)
	ЧекЛистПометкаПриИзмененииНаСервере(Элементы.ЧекЛист.ТекущиеДанные.Значение, Элементы.ЧекЛист.ТекущиеДанные.Пометка)
КонецПроцедуры

Процедура ЧекЛистПометкаПриИзмененииНаСервере(ПодЗадача, Пометка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПодЗадача", ПодЗадача);
	НайденныеСтроки = Объект.Подзадачи.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрПЗ Из НайденныеСтроки Цикл
		СтрПЗ.Выполнена = Пометка;	
	КонецЦикла; 
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодзадачу(Команда)
	
	НовСтрПодзадачи = Объект.Подзадачи.Добавить();
	НовСтрПодзадачи.ПодЗадача = врПодзадача;
	
	ЧекЛист.Очистить();
  	Для каждого СтрПодзадач Из Объект.Подзадачи Цикл
		ЧекЛист.Добавить(СтрПодзадач.ПодЗадача, , СтрПодзадач.Выполнена);	
	КонецЦикла; 
	врПодзадача = "";
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомментыНаСервере()
	
	СписокКомментариев.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комментарии.ТекстКомментария КАК ТекстКомментария,
		|	Комментарии.Автор КАК Автор,
		|	Комментарии.ВремяКоммента КАК ВремяКоммента
		|ИЗ
		|	РегистрСведений.Комментарии КАК Комментарии
		|ГДЕ
		|	НЕ Комментарии.НеПоказывать
		|	И Комментарии.ОбъектКомментирования = &ЭтаЗадача
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВремяКоммента";
	
	Запрос.УстановитьПараметр("ЭтаЗадача", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстКоммента = "" + ВыборкаДетальныеЗаписи.Автор + ": " + ВыборкаДетальныеЗаписи.ТекстКомментария +
						" (" + ВыборкаДетальныеЗаписи.ВремяКоммента + ")";
		СписокКомментариев.Добавить(ТекстКоммента);	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомменты(Команда)
	ОбновитьКомментыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если СокрЛП(врКоммент) <> "" Тогда
			Коммент = РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
			Коммент.ОбъектКомментирования = Объект.Ссылка;
			Коммент.Автор = ПараметрыСеанса.ТекущийПользователь;
			Коммент.ВремяКоммента = ТекущаяДата();
			Коммент.ТекстКомментария = врКоммент;
			Коммент.Записать(Истина);
			врКоммент = "";
		КонецЕсли; 
	Иначе
		Сообщить("Необходимо записать документ перед комментированием!");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоммент(Команда)
	ДобавитьКомментНаСервере();
	ОбновитьКомментыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	Записать(); //статус "создана" уже есть
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Запланировать(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "ОжиданиеВыполнения");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВРаботу(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Выполняется");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НаПроверку(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "НаПроверку");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Завершена");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзм(Команда)
	Записать();
КонецПроцедуры

 