
Процедура ПередЗаписью(Отказ)
	
	//отправим сообщение заинтересованным лицам
	Если ЭтотОбъект.Ссылка.Состояние <> ЭтотОбъект.Состояние Тогда
		//исполнителю
		Если ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
			ОбщийМодульЗадачи.ОтправитьСообщение("Изменилось состояние задачи """ + ЭтотОбъект.Ссылка +
				""": " + ЭтотОбъект.Состояние, ЭтотОбъект.Ответственный.telegram);	
		КонецЕсли;	
		//заказчику
		Если ЗначениеЗаполнено(ЭтотОбъект.Заказчик) Тогда
			ОбщийМодульЗадачи.ОтправитьСообщение("Изменилось состояние задачи """ + ЭтотОбъект.Ссылка +
				""": " + ЭтотОбъект.Состояние, ЭтотОбъект.Заказчик.telegram);	
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
