
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Задачи 
	Движения.Задачи.Записывать = Истина;
	Для Каждого ТекСтрокаЗадачи Из Задачи Цикл
		Движение = Движения.Задачи.Добавить();
		Движение.Период = ОтчетныйПериод;
		Движение.ОтчетныйПериод = ОтчетныйПериод;
		Движение.Задача = ТекСтрокаЗадачи.Задача;
		Движение.Проект = Проект;
		Движение.Сумма = ТекСтрокаЗадачи.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
