
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПостановщикЗадачи = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
		Объект.Состояние = Справочники.СостоянияЗадач.Создана;
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПроект) Тогда
			Объект.ПроектГруппа = ПараметрыСеанса.ТекущийПроект;	
		КонецЕсли;
		Объект.ДатаСоздания = ТекущаяДата();
		Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Справочники.Задача.ПустаяСсылка());
	Иначе
		Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Объект.Ссылка);
	КонецЕсли; 

	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

Процедура ОбновитьВидимостьЭлементов()
	
	Если Объект.Состояние = Справочники.СостоянияЗадач.Создана и ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Запланировать.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаПланировании Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.ВРаботу.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Выполняется Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.НаПроверку.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.НаКонтроле Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.ЦветФона = ЦветаСтиля.Зеленый;
	ИначеЕсли Объект.Состояние = Справочники.СостоянияЗадач.Завершена Тогда
		Элементы.Создать.Доступность = Ложь;
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
	Иначе //еще не записана
		Элементы.Запланировать.Доступность = Ложь;
		Элементы.ВРаботу.Доступность = Ложь;
		Элементы.НаПроверку.Доступность = Ложь;
		Элементы.Завершить.Доступность = Ложь;
		Элементы.Создать.ЦветФона = ЦветаСтиля.Зеленый;
	КонецЕсли; 
	
КонецПроцедуры
 

&НаСервере
Процедура РедактироватьНаСервере()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	РедактироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	врОписаниеИзХранилища = ТекущийОбъект.ОписаниеЗадачи.Получить();
	Если ТипЗнч(врОписаниеИзХранилища) = Тип("Строка") Тогда
		ВрОписание.Добавить(врОписаниеИзХранилища);
	Иначе
		ВрОписание = врОписаниеИзХранилища;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеЗадачи = Новый ХранилищеЗначения(ВрОписание);
	ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	Если Объект.Состояние = Справочники.СостоянияЗадач.Завершена Тогда
		Объект.ДатаЗавершенияФакт = ТекущаяДата();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныйПериодПриИзменении(Элемент)
	
	//для ежемесячных задач
	//Объект.ОтчетныйПериод = КонецМесяца(Объект.ОтчетныйПериод);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если СокрЛП(врКоммент) <> "" Тогда
			Коммент = РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
			Коммент.ОбъектКомментирования = Объект.Ссылка;
			Коммент.Автор = ПараметрыСеанса.ТекущийПользователь;
			Коммент.ВремяКоммента = ТекущаяДата();
			Коммент.ТекстКомментария = врКоммент;
			Коммент.Записать(Истина);
			врКоммент = "";
		КонецЕсли; 
	Иначе
		Сообщить("Необходимо записать документ перед комментированием!");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоммент(Команда)
	ДобавитьКомментНаСервере();
	Элементы.Комментарии.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	Записать(); //статус "создана" уже есть
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура Запланировать(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "ОжиданиеВыполнения");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВРаботу(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Выполняется");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НаПроверку(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "НаПроверку");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ОбщийМодульЗадачи.ИзменениеСтатусаЗадачи(Объект.Ссылка, "Завершена");
	ОбновитьВидимостьЭлементов();
	//ОбновитьОтображениеДанных(Элементы.Состояние);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзм(Команда)
	Записать();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Комментарии.Параметры.УстановитьЗначениеПараметра("ЭтаЗадача", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьГлавноеОкно");
КонецПроцедуры


 