
&НаСервере
Процедура ЗаполнитьАвтоНаСервере()

	Объект.Задачи.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задача.Ссылка КАК Ссылка,
		|	Задача.СтоимостьЗадачи КАК СтоимостьЗадачи
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.ПроектГруппа = &ПроектГруппа
		|	И Задача.ОтчетныйПериод = &ОтчетныйПериод
		|	И Задача.Состояние = ЗНАЧЕНИЕ(Справочник.СостоянияЗадач.Завершена)
		|ИТОГИ ПО
		|	Задача.Заказчик";
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", Объект.ОтчетныйПериод);
	Запрос.УстановитьПараметр("ПроектГруппа", Объект.Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказчик = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказчик.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаЗаказчик.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 			НовСтр = Объект.Задачи.Добавить();
			НовСтр.Задача = ВыборкаДетальныеЗаписи.Ссылка;
			НовСтр.Сумма = ВыборкаДетальныеЗаписи.СтоимостьЗадачи;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда)
	ЗаполнитьАвтоНаСервере();
КонецПроцедуры
