
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Задачи 
	Движения.Задачи.Записывать = Истина;
	Для Каждого ТекСтрокаЗадачи Из Задачи Цикл
		Движение = Движения.Задачи.Добавить();
		Движение.Период = ОтчетныйПериод;
		Движение.ОтчетныйПериод = ОтчетныйПериод;
		Движение.Задача = ТекСтрокаЗадачи.Задача;
		Движение.Проект = Проект;
		Движение.Сумма = -ТекСтрокаЗадачи.Сумма;
	КонецЦикла;

	// регистр Деньги
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Если ВидОперацииДС = Перечисления.ВидыОперацийДС.ПриходДС Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе	
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли; 
	Движение.Период = Дата;
	Движение.Проект = Проект;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Акт") Тогда
		// Заполнение шапки
		Контакт = ДанныеЗаполнения.Контакт;
		ОтчетныйПериод = ДанныеЗаполнения.ОтчетныйПериод;
		Проект = ДанныеЗаполнения.Проект;
		Сумма = ДанныеЗаполнения.Сумма;
		ВидОперацииДС = Перечисления.ВидыОперацийДС.ПриходДС;
		Для Каждого ТекСтрокаЗадачи Из ДанныеЗаполнения.Задачи Цикл
			НоваяСтрока = Задачи.Добавить();
			НоваяСтрока.Задача = ТекСтрокаЗадачи.Задача;
			НоваяСтрока.Сумма = ТекСтрокаЗадачи.Сумма;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


