
Процедура ИзменениеСтатусаЗадачи(Задача, Статус = Неопределено) Экспорт
	
	Если Статус <> Неопределено Тогда
		ДокОб = Задача.ПолучитьОбъект();
		Если Статус = "Завершена" Тогда
			ДокОб.Состояние = Справочники.СостоянияЗадач.Завершена;	
		ИначеЕсли Статус = "ОжиданиеВыполнения" Тогда
			ДокОб.Состояние = Справочники.СостоянияЗадач.НаПланировании;	
		ИначеЕсли Статус = "Выполняется" Тогда
			ДокОб.Состояние = Справочники.СостоянияЗадач.Выполняется;	
		ИначеЕсли Статус = "Приостановлена" Тогда
			ДокОб.Состояние = Справочники.СостоянияЗадач.Приостановлена;	
		ИначеЕсли Статус = "НаПроверку" Тогда
			ДокОб.Состояние = Справочники.СостоянияЗадач.НаКонтроле;	
		Иначе
			ДокОб.Состояние = Справочники.СостоянияЗадач.Создана;	
		КонецЕсли; 
		ДокОб.Записать();
	КонецЕсли; 
	
КонецПроцедуры